<?php
	 $quotes[] = 'Когда я работал над автопортретом, то не изобразил ни одного прыща, потому что именно так и следует поступать. Прыщи — это временное явление, они не имеют ничего общего с тем, как ты на самом деле выглядишь. Всегда опускай изъяны — им не место на хорошей картине, которую ты задумал.<br /> <p align="right"><i>Энди Уорхол</i></p>';
   	 $quotes[] = 'Я по-настоящему верю, что есть вещи, которые никто не может увидеть пока я их не сфотографирую.<br /> <p align="right"><i>Диана Арбус</i></p>';
   	 $quotes[] = 'Наблюдай и думай до того как нажать кнопку затвора. Сердце и разум - вот настоящие объективы фотокамеры.<br /><p align="right"><i>Юсуф Карш</i></p>';
   	 $quotes[] = 'Всё вокруг нас, живое или мертвое, в глазах безумного фотографа загадочно трансформируется в различные вариации, чтобы неодушевленный на вид объект ожил благодаря свету или его окружению.<br /><p align="right"><i>Йосеф Судек</i></p>';
   	 $quotes[] = 'Я не хотела заниматься «высоким искусством», у меня не было интереса к живописи, я хотела сфотографировать то, что любой мог понять, не зная ничего о современном искусстве. Я не хотела,чтобы работа походила на товар.<br /><p align="right"><i>Синди Шерман</i></p>';
   	 $quotes[] = 'Это так просто – никто не верит мне …вы принимаете позу, ставите освещение. Затем Вы паясничаете и экспрессивно изображаете некое действие. Потом  фотографируете.<br /><p align="right"><i>Джордж Харрелл</i></p>';
   	 $quotes[] = 'То, что фотограф способен увидеть, а об увиденном — сказать, имеет несравненно большее значение, чем качество технического оборудования.<br /><p align="right"><i>Ансель Адамс</i></p>';
   	 $quotes[] = 'Фотографировать можно везде, где есть свет.<br /><p align="right"><i>Альфред Стиглиц</i></p>';
   	 $quotes[] = 'Фотография — это не спорт. У нее нет правил. Все должно быть испробовано.<br /><p align="right"><i>Бил Брандт</i></p>';
   	 $quotes[] = 'Разница между хорошим произведением и посредственностью — вопрос миллиметров.<br /><p align="right"><i>Анри Картье-Брессон</i></p>';
   	 $quotes[] = 'Мои портреты больше обо мне, чем о тех, кого я фотографирую.<br /><p align="right"><i>Ричард Аведон</i></p>';
   	 $quotes[] = 'Картина, которую хвалят больше, чем десять процентов публики, подлежит сожжению.<br /><p align="right"><i>Джордж Бернард Шоу</i></p>';
   	 $quotes[] = 'Фотографировать может только тот, кто сумеет выстроить на одной оси глаз, голову и сердце. <br /><p align="right"><i>Анри-Картье Брессон</i></p>';
   	 $quotes[] = 'Вспоминать правила композиции перед съемкой все равно, что мыслить о законе гравитации, выходя на прогулку. <br /><p align="right"><i>Эдвард Уэстон</i></p>';
   	 $quotes[] = 'Мы ограниченны не нашими возможностями, а нашим видением предмета.<br /><p align="right"><i>Сесиль Битон</i></p>';
   	 $quotes[] = 'Если изображение не шокирует, оно ничто.<br /><p align="right"><i>Марсель Дюшам</i></p>';
   	 $quotes[] = 'Когда я говорю, что хочу сфотографировать кого-то, это значит, что я хочу узнать его. Всех, кого я знаю, я фотографирую.<br /><p align="right"><i>Энни Лейбовиц</i></p>';
   	 $quotes[] = 'Для практики я мысленно все фотографирую.<br /><p align="right"><i>Минор Уайт</i></p>';
     srand ((double) microtime() * 1000000); $random_number = rand(0,count($quotes)-1);  echo ($quotes[$random_number]);   ?>
